import random

word_list = ["Говно", "залупа", "пенис", "хер", "давалка", "хуй", "блядина", "Головка", "шлюха", "жопа", "член", "еблан", "петух…", "Мудила", "Рукоблуд", "ссанина", "очко", "блядун", "вагина", "Сука", "ебланище", "влагалище", "пердун", "дрочила", "Пидор", "пизда", "туз", "малафья", "Гомик", "мудила", "пилотка", "манда", "Анус", "вагина", "путана", "педрила", "Шалава", "хуило", "мошонка", "елда"]
lives = 6

def get_word():
    return random.choice(word_list)

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |     /'\
                   -
                ''',
                # голова, торс, обе руки, одна нога
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |     /'
                   -
                ''',
                # голова, торс, обе руки
                '''
                   --------
                   |      |
                   |      O
                   |     \|/
                   |      |
                   |      '
                   -
                ''',
                # голова, торс и одна рука
                '''
                   --------
                   |      |
                   |      O
                   |     \|
                   |      |
                   |      '
                   -
                ''',
                # голова и торс
                '''
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |      '
                   -
                ''',
                # голова
                '''
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   -
                ''',
                # начальное состояние
                '''
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   -
                '''
    ]
    return stages[tries]

def play():
    pass
